In [3]:
from env import get_db_url
import pandas as pd

In [23]:
url = get_db_url("employees")
sql = """
SELECT * 
FROM employees 
Limit 20"""

employees = pd.read_sql(sql,url)

employees_df = '''
SELECT *
FROM employees'''

emp_df = pd.read_sql(employees_df,url)
emp_df.head()

In [24]:
emp_df.shape

(300024, 6)

In [48]:
titles_df = '''
SELECT *
FROM titles'''

titles = pd.read_sql(titles_df, url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [50]:
titles.shape

(443308, 4)

In [34]:
emp_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [51]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [52]:
len(titles.title.unique())

7

In [53]:
# sql 
pd.read_sql("SELECT MIN(to_date) FROM titles", url)

  MIN(to_date)
0   1985-03-01

In [54]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [55]:
titles.to_date.max()

datetime.date(9999, 1, 1)